<template>
    <main class="page">
        <div class="container">
            <h1 class="page-title">
                Согласие на обработку персональных данных
            </h1>

            <div :class="$style.content">
                <p>
                    Нажимая кнопку «Регистрация»,
                    я даю согласие Игнатову Вадиму Сергеевичу на обработку моих данных, содержащихся в регистрационной форме,
                    на любое действие (операцию) или совокупность действий (операций), совершаемых с моими персональными данными, включая (без ограничений) сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ),
                    обезличивание, блокирование, удаление, уничтожение персональных данных, для целей обеспечения соблюдения законов и иных нормативно-правовых актов, а также осуществление любых других действий, предусмотренных действующим законодательством Российской Федерации,
                    с использованием средств автоматизации, в том числе в информационно-телекоммуникационных сетях, или без использования таких средств, если обработка персональных данных без использования таких средств соответствует характеру действий (операций), совершаемых
                    с персональными данными с использованием средств автоматизации, то есть позволяет осуществлять в соответствии с заданным алгоритмом поиск персональных данных, зафиксированных на материальном носителе и содержащихся в картотеках или иных систематизированных собраниях персональных данных,
                    и/или доступ к таким персональным данным.
                </p>

                <p>
                    Настоящим я подтверждаю, что переданные мной персональные данные являются достоверными и могут обрабатываться в целях корректной работы на сайте.
                </p>

                <p>
                    Я согласен(на) с тем, что текст данного мной по собственной воле и в моих интересах согласия хранится в электронном виде в базе данных и/или на бумажном носителе и подтверждает факт согласия на обработку персональных данных в соответствии с вышеизложенными положениями и беру на себя ответственность за достоверность предоставления персональных данных.
                    Согласие дается на неопределенный срок и может быть в любой момент мной отозвано путем направления по адресу электронной почты ignatov0131@gmail.com.
                </p>
            </div>
        </div>
    </main>
</template>

<script>

</script>

<style lang="sass" module>
.content
    p
        &:not(:last-child)
            margin-bottom: $offset-m
            line-height: 24px
</style>
